Repository: NikM19/inventory-app
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: fi

source: Требуются права редактора.
fi: Tarvitaan muokkausoikeudet.

source: Ссылка недействительна или уже использована.
fi: Linkki on virheellinen tai sitä on jo käytetty.

source: Аккаунт уже активирован.
fi: Tili on jo aktivoitu.

source: Аккаунт успешно активирован! Теперь вы можете войти.
fi: Tili aktivoitiin onnistuneesti! Voit nyt kirjautua sisään.

source: Неверный логин или пароль!
fi: Virheellinen käyttäjätunnus tai salasana!

source: Аккаунт не активирован! Проверьте email и перейдите по ссылке для активации.
fi: Tiliä ei ole aktivoitu! Tarkista sähköpostisi ja aktivoi tili linkin avulla.

source: Вход выполнен!
fi: Kirjautuminen onnistui!

source: Вы вышли из аккаунта.
fi: Olet kirjautunut ulos tililtäsi.

source: Запись журнала не найдена.
fi: Lokimerkintää ei löytynyt.

source: Эту операцию нельзя отменить.
fi: Tätä toimenpidettä ei voi perua.

source: Восстановление недоступно: корзина не включена.
fi: Palautus ei ole käytettävissä: roskakori ei ole käytössä.

source: Товар не найден — восстановление невозможно.
fi: Tuotetta ei löydy — palautus ei ole mahdollista.

source: Товар уже активен.
fi: Tuote on jo aktiivinen.

source: Отмена удаления по записи журнала #%(id)s
fi: Poiston peruminen lokimerkinnän #%(id)s perusteella

source: Удаление отменено: товар "%(name)s" восстановлен.
fi: Poisto peruttu: tuote "%(name)s" palautettu.

source: Пользователь
fi: Käyttäjä

source: Действие
fi: Toiminto

source: Тип объекта
fi: Kohteen tyyppi

source: ID объекта
fi: Kohteen ID

source: Дата и время
fi: Päivämäärä ja aika

source: Детали
fi: Tiedot

source: Введите название товара
fi: Syötä tuotteen nimi

source: Некорректное число! Введите, например, 10 или 10.5
fi: Virheellinen numero! Syötä esimerkiksi 10 tai 10.5

source: Добавлен товар:
fi: Lisätty tuote:

source: Товар "%(name)s" добавлен!
fi: Tuote "%(name)s" lisätty!

source: Товар не найден!
fi: Tuotetta ei löydy!

source: Обновлён товар:
fi: Päivitetty tuote:

source: Товар "%(name)s" обновлён!
fi: Tuote "%(name)s" päivitetty!

source: Введите корректное число.
fi: Syötä kelvollinen numero.

source: Количество должно быть больше нуля.
fi: Määrän on oltava suurempi kuin nolla.

source: Нельзя списать %(a).2f — на складе только %(q).2f.
fi: Ei voi vähentää %(a).2f — varastossa on vain %(q).2f.

source: Списано со склада: -%(a).2f %(u)s
fi: Vähennetty varastosta: -%(a).2f %(u)s

source: Списано %(a).2f %(u)s. Остаток: %(r).2f %(u)s.
fi: Vähennetty %(a).2f %(u)s. Jäljellä: %(r).2f %(u)s.

source: Поступление на склад: +%(a).2f %(u)s
fi: Lisäys varastoon: +%(a).2f %(u)s

source: Добавлено %(a).2f %(u)s. Теперь на складе: %(r).2f %(u)s.
fi: Lisätty %(a).2f %(u)s. Varastossa nyt: %(r).2f %(u)s.

source: Товар не найден! Возможно, он уже был удалён.
fi: Tuotetta ei löydy! Se on ehkä jo poistettu.

source: Товар удалён!
fi: Tuote poistettu!

source: Удалён товар:
fi: Poistettu tuote:

source: Фото добавлены
fi: Kuvat lisätty

source: Фото не найдено
fi: Kuvaa ei löytynyt

source: Фото удалено
fi: Kuva poistettu

source: Главное фото обновлено
fi: Pääkuva päivitetty

source: Введите название категории.
fi: Syötä kategorian nimi.

source: Такая категория уже есть.
fi: Tällainen kategoria on jo olemassa.

source: Добавлена категория:
fi: Lisätty kategoria:

source: Категория "%(name)s" создана!
fi: Kategoria "%(name)s" luotu!

source: Название
fi: Nimi

source: Описание
fi: Kuvaus

source: Количество
fi: Määrä

source: Ед. изм.
fi: Yksikkö

source: Размер
fi: Koko

source: Цена (€)
fi: Hinta (€)

source: Добавить категорию
fi: Lisää kategoria

source: Название категории
fi: Kategorian nimi

source: Сохранить
fi: Tallenna

source: Отмена
fi: Peruuta

source: Склад Artkivi
fi: Artkivi varasto

source: Склад
fi: varasto

source: Язык
fi: Kieli

source: Журнал действий
fi: Toimintaloki

source: Выйти
fi: Kirjaudu ulos

source: Вход
fi: Kirjaudu sisään

source: Подтверждение
fi: Vahvistus

source: Закрыть
fi: Sulje

source: Удалить
fi: Poista

source: Добавить товар
fi: Lisää tuote

source: Назад
fi: Takaisin

source: Категория
fi: Kategoria

source: Без категории
fi: Ei kategoriaa

source: Редактировать категорию
fi: Muokkaa kategoriaa

source: Ед. измерения
fi: Yksikkö

source: Цена, €
fi: Hinta, €

source: Картинки товара
fi: Tuotekuvat

source: Можно выбрать несколько файлов — они прикрепятся при сохранении.
fi: Voit valita useita tiedostoja — ne liitetään tallennettaessa.

source: Новое название категории
fi: Kategorian uusi nimi

source: Редактировать товар
fi: Muokkaa tuotetta

source: Добавить фото (можно несколько)
fi: Lisää kuvia (voi useita)

source: Выберите одно или несколько файлов. Они прикрепятся при сохранении.
fi: Valitse yksi tai useampi tiedosto. Ne liitetään tallennettaessa.

source: Фотографии товара
fi: Tuotekuvat

source: Главное
fi: Pääkuva

source: Сделать главным
fi: Aseta pääkuvaksi

source: Удалить фото?
fi: Poistetaanko kuva?

source: Учёт товаров
fi: Varastonhallinta

source: Скачать Excel
fi: Lataa Excel

source: Название...
fi: Nimi...

source: Все категории
fi: Kaikki kategoriat

source: Цена ≤
fi: Hinta ≤

source: Кол-во ≥
fi: Määrä ≥

source: Поиск
fi: Hae

source: Нет на складе
fi: Ei varastossa

source: Показывать товары с нулевым остатком
fi: Näytä nollasaldoiset tuotteet

source: Сбросить фильтр
fi: Tyhjennä suodattimet

source: Действия
fi: Toiminnot

source: Открыть товар:
fi: Avaa tuote

source: Итого:
fi: Yhteensä:

source: Редактировать
fi: Muokkaa

source: Удалить товар «%(name)s»?
fi: Poistetaanko tuote «%(name)s»?

source: Ничего не найдено
fi: Ei hakutuloksia

source: Статистика:
fi: Tilastot:

source: Всего товаров:
fi: Tuotteita yhteensä:

source: Всего категорий:
fi: Kategorioita yhteensä:

source: Последние добавленные товары:
fi: Viimeksi lisätyt tuotteet:

source: Не удалось сохранить. Попробуйте ещё раз.
fi: Tallennus epäonnistui. Yritä uudelleen.

source: Войти
fi: Kirjaudu sisään

source: Логин
fi: Käyttäjätunnus

source: Пароль
fi: Salasana

source: Показать пароль
fi: Näytä salasana

source: Скрыть пароль
fi: Piilota salasana

source: Объект
fi: Objekti

source: Восстановить товар
fi: Palauta tuote

source: Восстановить
fi: Palauta

source: Отменить удаление
fi: Peru poisto

source: Невозможно отменить: нет ID записи журнала
fi: Ei voi perua: lokimerkinnän ID puuttuu

source: Записей не найдено
fi: Merkintöjä ei löytynyt

source: Регистрация
fi: Rekisteröidy

source: Зарегистрироваться
fi: Rekisteröidy

source: Уже есть аккаунт? Войти
fi: Onko sinulla jo tili? Kirjaudu sisään

source: Отчёты
fi: Raportit

source: Общий список товаров
fi: Tuoteluettelo

source: Кол-во
fi: Määrä

source: Дата добавления
fi: Lisäyspäivä

source: Товаров пока нет.
fi: Tuotteita ei ole vielä.

source: Просмотр товара
fi: Tuotteen katselu

source: Предыдущее фото
fi: Edellinen kuva

source: Следующее фото
fi: Seuraava kuva

source: Вперёд
fi: Seuraava

source: Остаток на складе
fi: Varastosaldo

source: Складские операции
fi: Varastotoiminnot

source: Списать,
fi: Vähennä,

source: Комментарий (необязательно)
fi: Kommentti (valinnainen)

source: Списать со склада
fi: Vähennä varastosta

source: Пополнить,
fi: Lisää,

source: Пополнить склад
fi: Lisää varastoon

source: Удалить товар
fi: Poistetaanko tuote

source: {editor}: Editing failed
fi: {editor}: Muokkaus epäonnistui

source: {editor}: Editing failed: {e}
fi: {editor}: Muokkaus epäonnistui: {e}

source: Options
fi: Asetukset

source: Got unexpected extra argument ({args})
fi: Odottamaton ylimääräinen argumentti ({args})

source: DeprecationWarning: The command {name!r} is deprecated.{extra_message}
fi: Vanhentumisvaroitus: Komento {name!r} on vanhentunut.{extra_message}

source: Aborted!
fi: Keskeytetty!

source: Commands
fi: Komennot

source: Missing command.
fi: Komento puuttuu.

source: No such command {name!r}.
fi: Komentoa {name!r} ei löydy.

source: Value must be an iterable.
fi: Arvon täytyy olla iteroitava.

source: Takes {nargs} values but 1 was given.
fi: Vaatii {nargs} arvoa, mutta annettu 1.

source: DeprecationWarning: The {param_type} {name!r} is deprecated.{extra_message}
fi: Vanhentumisvaroitus: {param_type} {name!r} on vanhentunut.{extra_message}

source: env var: {var}
fi: ympäristömuuttuja: {var}

source: default: {default}
fi: oletus: {default}

source: required
fi: vaaditaan

source: (dynamic)
fi: (dynaaminen)

source: %(prog)s, version %(version)s
fi: %(prog)s, versio %(version)s

source: Show the version and exit.
fi: Näytä versio ja poistu.

source: Show this message and exit.
fi: Näytä tämä viesti ja poistu.

source: Error: {message}
fi: Virhe: {message}

source: Try '{command} {option}' for help.
fi: Kokeile '{command} {option}' saadaksesi apua.

source: Invalid value: {message}
fi: Virheellinen arvo: {message}

source: Invalid value for {param_hint}: {message}
fi: Virheellinen arvo kohteelle {param_hint}: {message}

source: Missing argument
fi: Argumentti puuttuu

source: Missing option
fi: Valinta puuttuu

source: Missing parameter
fi: Parametri puuttuu

source: Missing {param_type}
fi: {param_type} puuttuu

source: Missing parameter: {param_name}
fi: Parametri puuttuu: {param_name}

source: No such option: {name}
fi: Valintaa ei löydy: {name}

source: Did you mean {possibility}?
fi: Tarkoititko {possibility}?

source: unknown error
fi: tuntematon virhe

source: Could not open file {filename!r}: {message}
fi: Tiedostoa {filename!r} ei voitu avata: {message}

source: Usage:
fi: Käyttö:

source: Argument {name!r} takes {nargs} values.
fi: Argumentti {name!r} ottaa {nargs} arvoa.

source: Option {name!r} does not take a value.
fi: Valinta {name!r} ei ota arvoa.

source: Option {name!r} requires an argument.
fi: Valinta {name!r} vaatii argumentin.

source: Shell completion is not supported for Bash versions older than 4.4.
fi: Shellin täydennystä ei tueta Bash-versioissa vanhemmissa kuin 4.4.

source: Couldn't detect Bash version, shell completion is not supported.
fi: Bash-versiota ei voitu tunnistaa, shellin täydennystä ei tueta.

source: Repeat for confirmation
fi: Toista vahvistaaksesi

source: Error: The value you entered was invalid.
fi: Virhe: Syöttämäsi arvo oli virheellinen.

source: Error: {e.message}
fi: Virhe: {e.message}

source: Error: The two entered values do not match.
fi: Virhe: Syötetyt arvot eivät täsmää.

source: Error: invalid input
fi: Virhe: virheellinen syöte

source: Press any key to continue...
fi: Paina mitä tahansa näppäintä jatkaaksesi...

source: Choose from: {choices}
fi: Valitse: {choices}

source: {value!r} is not {choice}.
fi: {value!r} ei ole {choice}.

source: {value!r} does not match the format {format}.
fi: {value!r} ei vastaa muotoa {format}.

source: {value!r} is not a valid {number_type}.
fi: {value!r} ei ole kelvollinen {number_type}.

source: {value} is not in the range {range}.
fi: {value} ei ole alueella {range}.

source: {value!r} is not a valid boolean.
fi: {value!r} ei ole kelvollinen totuusarvo.

source: {value!r} is not a valid UUID.
fi: {value!r} ei ole kelvollinen UUID.

source: file
fi: tiedosto

source: directory
fi: hakemisto

source: path
fi: polku

source: {name} {filename!r} does not exist.
fi: {name} {filename!r} ei ole olemassa.

source: {name} {filename!r} is a file.
fi: {name} {filename!r} on tiedosto.

source: {name} {filename!r} is a directory.
fi: {name} {filename!r} on hakemisto.

source: {name} {filename!r} is not readable.
fi: {name} {filename!r} ei ole luettavissa.

source: {name} {filename!r} is not writable.
fi: {name} {filename!r} ei ole kirjoitettavissa.

source: {name} {filename!r} is not executable.
fi: {name} {filename!r} ei ole suoritettavissa.

source: {len_type} values are required, but {len_value} was given.
fi: {len_type} arvoa vaaditaan, mutta annettu {len_value}.
